Revit 2026 API

# ComboBoxAddItems Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ComboBoxMember> AddItems(
	IList<ComboBoxMemberData> memberData
)
```
```vb
Public Function AddItems (
	memberData As IList(Of ComboBoxMemberData)
) As IList(Of ComboBoxMember)
```
```cpp
public:
IList<ComboBoxMember^>^ AddItems(
	IList<ComboBoxMemberData^>^ memberData
)
```
```fsharp
member AddItems :
        memberData : IList<ComboBoxMemberData> -> IList<ComboBoxMember>
```

#### Parameters

memberData IListComboBoxMemberData

#### Return Value

IListComboBoxMember

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace